
## :white_check_mark: Apply Succeeded

[CI link](https://github.com/hkakehashi/webinar-202407/actions/runs/10139415062)



<pre><code>Apply complete! Resources: 1 added, 0 changed, 0 destroyed.</code></pre>

<details><summary>Details (Click me)</summary>

```hcl
2024-07-29T06:42:24.032Z [INFO]  Terraform version: 1.9.2
2024-07-29T06:42:24.032Z [INFO]  Go runtime version: go1.22.4
2024-07-29T06:42:24.032Z [INFO]  CLI args: []string{"/home/runner/work/_temp/18926884-a768-424e-b64c-0dcb286d67dc/terraform-bin", "apply", "-lock-timeout=30m", "-auto-approve"}
2024-07-29T06:42:24.032Z [INFO]  CLI command args: []string{"apply", "-lock-timeout=30m", "-auto-approve"}
2024-07-29T06:42:24.034Z [INFO]  backend-s3.aws-base: Retrieved initial credentials: tf_backend.operation=Configure tf_backend.req_id=9875d194-b507-0b1b-eb63-2920c2ff72a3 tf_backend.s3.bucket=s3backend-1xfu3xfk4bztr9-state-bucket tf_backend.s3.path=webinar202407/prod tf_aws.credentials_source=EnvConfigCredentials
2024-07-29T06:42:24.034Z [INFO]  backend-s3.aws-base: Assuming IAM Role: tf_backend.operation=Configure tf_backend.req_id=9875d194-b507-0b1b-eb63-2920c2ff72a3 tf_backend.s3.bucket=s3backend-1xfu3xfk4bztr9-state-bucket tf_backend.s3.path=webinar202407/prod tf_aws.assume_role.session_name="" tf_aws.assume_role.external_id="" tf_aws.assume_role.source_identity="" tf_aws.assume_role.role_arn=arn:aws:iam::139157552660:role/s3backend-1xfu3xfk4bztr9-tf-assume-role
2024-07-29T06:42:24.627Z [INFO]  backend-s3.aws-base: Retrieved credentials: tf_backend.operation=Configure tf_backend.req_id=9875d194-b507-0b1b-eb63-2920c2ff72a3 tf_backend.s3.bucket=s3backend-1xfu3xfk4bztr9-state-bucket tf_backend.s3.path=webinar202407/prod tf_aws.credentials_source=AssumeRoleProvider
2024-07-29T06:42:25.072Z [INFO]  backend-s3.aws-base: Retrieved caller identity from STS: tf_backend.operation=Configure tf_backend.req_id=9875d194-b507-0b1b-eb63-2920c2ff72a3 tf_backend.s3.bucket=s3backend-1xfu3xfk4bztr9-state-bucket tf_backend.s3.path=webinar202407/prod
2024-07-29T06:42:25.181Z [INFO]  backend-s3.aws-base: Retrieved caller identity from STS: tf_backend.operation=Configure tf_backend.req_id=9875d194-b507-0b1b-eb63-2920c2ff72a3 tf_backend.s3.bucket=s3backend-1xfu3xfk4bztr9-state-bucket tf_backend.s3.path=webinar202407/prod
2024-07-29T06:42:25.195Z [INFO]  backend/local: starting Apply operation
2024-07-29T06:42:25.560Z [INFO]  backend-s3: Downloading remote state: tf_backend.operation=Get tf_backend.req_id=48a6b5ac-f014-af2f-5e9c-5fc07258fc51 tf_backend.s3.bucket=s3backend-1xfu3xfk4bztr9-state-bucket tf_backend.s3.path=webinar202407/prod
2024-07-29T06:42:25.798Z [INFO]  provider: configuring client automatic mTLS
2024-07-29T06:42:25.818Z [INFO]  provider.terraform-provider-fastly_v5.11.0: configuring server automatic mTLS: timestamp=2024-07-29T06:42:25.818Z
2024-07-29T06:42:25.874Z [INFO]  provider: plugin process exited: plugin=.terraform/providers/registry.terraform.io/fastly/fastly/5.11.0/linux_amd64/terraform-provider-fastly_v5.11.0 id=2028
2024-07-29T06:42:25.875Z [INFO]  provider: configuring client automatic mTLS
2024-07-29T06:42:25.885Z [INFO]  provider.terraform-provider-fastly_v5.11.0: configuring server automatic mTLS: timestamp=2024-07-29T06:42:25.885Z
2024-07-29T06:42:25.936Z [INFO]  provider: plugin process exited: plugin=.terraform/providers/registry.terraform.io/fastly/fastly/5.11.0/linux_amd64/terraform-provider-fastly_v5.11.0 id=2038
2024-07-29T06:42:25.936Z [INFO]  backend/local: apply calling Plan
2024-07-29T06:42:25.938Z [INFO]  provider: configuring client automatic mTLS
2024-07-29T06:42:25.947Z [INFO]  provider.terraform-provider-fastly_v5.11.0: configuring server automatic mTLS: timestamp=2024-07-29T06:42:25.947Z
2024-07-29T06:42:25.996Z [WARN]  ValidateProviderConfig from "provider[\"registry.terraform.io/fastly/fastly\"]" changed the config value, but that value is unused
2024-07-29T06:42:26.020Z [WARN]  Provider "registry.terraform.io/fastly/fastly" produced an invalid plan for module.vcl_service.fastly_service_vcl.main, but we are tolerating it because it is using the legacy plugin SDK.
    The following problems may be the cause of any confusing errors from downstream operations:
      - .http3: planned value cty.False for a non-computed attribute
      - .stale_if_error_ttl: planned value cty.NumberIntVal(43200) for a non-computed attribute
      - .stale_if_error: planned value cty.False for a non-computed attribute
      - .comment: planned value cty.StringVal("Managed by Terraform") for a non-computed attribute
      - .default_ttl: planned value cty.NumberIntVal(3600) for a non-computed attribute
2024-07-29T06:42:26.023Z [INFO]  provider: plugin process exited: plugin=.terraform/providers/registry.terraform.io/fastly/fastly/5.11.0/linux_amd64/terraform-provider-fastly_v5.11.0 id=2047

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.vcl_service.fastly_service_vcl.main will be created
  + resource "fastly_service_vcl" "main" {
      + activate           = false
      + active_version     = (known after apply)
      + cloned_version     = (known after apply)
      + comment            = "Managed by Terraform"
      + default_ttl        = 3600
      + force_destroy      = true
      + force_refresh      = (known after apply)
      + http3              = false
      + id                 = (known after apply)
      + imported           = (known after apply)
      + name               = "webinar202407-prod"
      + stale_if_error     = false
      + stale_if_error_ttl = 43200
      + version_comment    = <<-EOT
            PR#2: Add code comments to test the pipeline
            https://github.com/hkakehashi/webinar-202407/pull/2
        EOT

      + backend {
          # At least one attribute in this block is (or was) sensitive,
          # so its contents will not be displayed.
        }

      + domain {
          + name    = "webinar202407-prod.global.ssl.fastly.net"
            # (1 unchanged attribute hidden)
        }

      + vcl {
          + content = <<-EOT
                sub vcl_recv {
                #FASTLY recv
                  # comment for CI test
                
                  # Normally, you should consider requests other than GET and HEAD to be uncacheable
                  # (to this we add the special FASTLYPURGE method)
                  if (req.method != "HEAD" && req.method != "GET" && req.method != "FASTLYPURGE") {
                    return(pass);
                  }
                
                  # If you are using image optimization, insert the code to enable it here
                  # See https://www.fastly.com/documentation/reference/io/ for more information.
                
                  return(lookup);
                }
                
                sub vcl_hash {
                  set req.hash += req.url;
                  set req.hash += req.http.host;
                #FASTLY hash
                  return(hash);
                }
                
                sub vcl_hit {
                #FASTLY hit
                  return(deliver);
                }
                
                sub vcl_miss {
                #FASTLY miss
                  return(fetch);
                }
                
                sub vcl_pass {
                #FASTLY pass
                  return(pass);
                }
                
                sub vcl_fetch {
                #FASTLY fetch
                
                  # Unset headers that reduce cacheability for images processed using the Fastly image optimizer
                  if (req.http.X-Fastly-Imageopto-Api) {
                    unset beresp.http.Set-Cookie;
                    unset beresp.http.Vary;
                  }
                
                  # Log the number of restarts for debugging purposes
                  if (req.restarts > 0) {
                    set beresp.http.Fastly-Restarts = req.restarts;
                  }
                
                  # If the response is setting a cookie, make sure it is not cached
                  if (beresp.http.Set-Cookie) {
                    return(pass);
                  }
                
                  # By default we set a TTL based on the `Cache-Control` header but we don't parse additional directives
                  # like `private` and `no-store`. Private in particular should be respected at the edge:
                  if (beresp.http.Cache-Control ~ "(?:private|no-store)") {
                    return(pass);
                  }
                
                  # If no TTL has been provided in the response headers, set a default
                  if (http_status_matches(beresp.status, "200,206,301,302")) {
                    if (!beresp.http.Cache-Control) {
                      set beresp.ttl = 86400s;
                      set beresp.http.Cache-Control = "max-age=86400";
                
                      # Apply a longer default TTL for images processed using Image Optimizer
                      if (req.http.X-Fastly-Imageopto-Api) {
                        set beresp.ttl = 2592000s; # 30 days
                        set beresp.http.Cache-Control = "max-age=2592000, public";
                      }
                    }
                  }
                
                  return(deliver);
                }
                
                sub vcl_error {
                #FASTLY error
                  return(deliver);
                }
                
                sub vcl_deliver {
                #FASTLY deliver
                
                  if (req.http.Fastly-Debug) {
                    set resp.http.Fastly-Debug-VCL-Version = req.vcl.version;
                  }
                
                  return(deliver);
                }
                
                sub vcl_log {
                #FASTLY log
                }
            EOT
          + main    = true
          + name    = "main"
        }
    }

Plan: 1 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + active_version = (known after apply)
  + service_id     = (known after apply)
  + service_url    = (known after apply)
2024-07-29T06:42:26.028Z [INFO]  backend/local: apply calling Apply
2024-07-29T06:42:26.032Z [INFO]  provider: configuring client automatic mTLS
2024-07-29T06:42:26.042Z [INFO]  provider.terraform-provider-fastly_v5.11.0: configuring server automatic mTLS: timestamp=2024-07-29T06:42:26.042Z
2024-07-29T06:42:26.091Z [WARN]  ValidateProviderConfig from "provider[\"registry.terraform.io/fastly/fastly\"]" changed the config value, but that value is unused
2024-07-29T06:42:26.113Z [WARN]  Provider "registry.terraform.io/fastly/fastly" produced an invalid plan for module.vcl_service.fastly_service_vcl.main, but we are tolerating it because it is using the legacy plugin SDK.
    The following problems may be the cause of any confusing errors from downstream operations:
      - .stale_if_error: planned value cty.False for a non-computed attribute
      - .stale_if_error_ttl: planned value cty.NumberIntVal(43200) for a non-computed attribute
      - .comment: planned value cty.StringVal("Managed by Terraform") for a non-computed attribute
      - .default_ttl: planned value cty.NumberIntVal(3600) for a non-computed attribute
      - .http3: planned value cty.False for a non-computed attribute
module.vcl_service.fastly_service_vcl.main: Creating...
2024-07-29T06:42:26.115Z [INFO]  Starting apply for module.vcl_service.fastly_service_vcl.main
2024-07-29T06:42:27.758Z [INFO]  provider.terraform-provider-fastly_v5.11.0: Skipping activation of Fastly Service (X0pf6l65u0Hrx9atZ4dLu0), Version (1): timestamp=2024-07-29T06:42:27.758Z
2024-07-29T06:42:27.758Z [INFO]  provider.terraform-provider-fastly_v5.11.0: The Terraform definition is explicitly specified to not activate the changes on Fastly: timestamp=2024-07-29T06:42:27.758Z
2024-07-29T06:42:27.758Z [INFO]  provider.terraform-provider-fastly_v5.11.0: Version (1) has been pushed and validated: timestamp=2024-07-29T06:42:27.758Z
2024-07-29T06:42:27.758Z [INFO]  provider.terraform-provider-fastly_v5.11.0: Visit https://manage.fastly.com/configure/services/X0pf6l65u0Hrx9atZ4dLu0/versions/1 and activate it manually: timestamp=2024-07-29T06:42:27.758Z
2024-07-29T06:42:28.680Z [WARN]  provider.terraform-provider-fastly_v5.11.0: Response contains warning diagnostic: tf_resource_type=fastly_service_vcl @caller=github.com/hashicorp/terraform-plugin-go@v0.23.0/tfprotov5/internal/diag/diagnostics.go:60 diagnostic_summary="Some changes are ignored" tf_provider_addr=provider tf_req_id=f7be6e44-d0c5-310b-b307-0c6dc6702381 tf_proto_version=5.6 tf_rpc=ApplyResourceChange @module=sdk.proto diagnostic_detail="'name' and 'comment' attributes can only be updated with 'activate = true'" diagnostic_severity=WARNING timestamp=2024-07-29T06:42:28.679Z
2024-07-29T06:42:28.683Z [WARN]  Provider "provider[\"registry.terraform.io/fastly/fastly\"]" produced an unexpected new value for module.vcl_service.fastly_service_vcl.main, but we are tolerating it because it is using the legacy plugin SDK.
    The following problems may be the cause of any confusing errors from downstream operations:
      - .default_host: was null, but now cty.StringVal("")
module.vcl_service.fastly_service_vcl.main: Creation complete after 3s [id=X0pf6l65u0Hrx9atZ4dLu0]
2024-07-29T06:42:28.687Z [INFO]  provider: plugin process exited: plugin=.terraform/providers/registry.terraform.io/fastly/fastly/5.11.0/linux_amd64/terraform-provider-fastly_v5.11.0 id=2056
2024-07-29T06:42:28.688Z [INFO]  backend-s3: Uploading remote state: tf_backend.operation=Put tf_backend.req_id=b4179bd7-891f-d846-f9e2-ea18d2802f48 tf_backend.s3.bucket=s3backend-1xfu3xfk4bztr9-state-bucket tf_backend.s3.path=webinar202407/prod
╷
│ Warning: Some changes are ignored
│ 
│   with module.vcl_service.fastly_service_vcl.main,
│   on ../../modules/vcl_service/main.tf line 5, in resource "fastly_service_vcl" "main":
│    5: resource "fastly_service_vcl" "main" {
│ 
│ 'name' and 'comment' attributes can only be updated with 'activate = true'
╵

Apply complete! Resources: 1 added, 0 changed, 0 destroyed.

Outputs:

service_id = "X0pf6l65u0Hrx9atZ4dLu0"
service_url = "https://cfg.fastly.com/X0pf6l65u0Hrx9atZ4dLu0"

```

</details>

<!-- github-comment: {"Command":"apply","JobName":"terraform","PRNumber":2,"Program":"tfcmt","SHA1":"9d907164c7a6f6f9556995143de2e9b01e206858","Vars":{},"WorkflowName":"Run Terraform"} -->